renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
/*******************************************************************************
  Ethernet Peripheral Library Interface Header

  Company:
    Microchip Technology Inc.

  File Name:
    plib_eth.h

  Summary:
    Defines the Ethernet Peripheral Library Interface.

  Description:
    This header file contains the function prototypes and definitions of
    the data types and constants that make up the interface to the Ethernet
    Peripheral Library for Microchip microcontrollers.  The definitions in this 
    file are for the Ethernet module.
*******************************************************************************/

// DOM-IGNORE-BEGIN
/*******************************************************************************
Copyright 2013-2015 released Microchip Technology Inc.  All rights reserved.

Microchip licenses to you the right to use, modify, copy and distribute
Software only when embedded on a Microchip microcontroller or digital signal
controller that is integrated into your product or third party product
(pursuant to the sublicense terms in the accompanying license agreement).

You should refer to the license agreement accompanying this Software for
additional information regarding your rights and obligations.

SOFTWARE AND DOCUMENTATION ARE PROVIDED AS IS WITHOUT WARRANTY OF ANY KIND,
EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF
MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER
CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR
OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR
CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT OF
SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
(INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
*******************************************************************************/
// DOM-IGNORE-END

#ifndef _PLIB_ETH_H
#define _PLIB_ETH_H

#include <stdio.h>
#include <xc.h>

// DOM-IGNORE-BEGIN
#ifdef __cplusplus  // Provide C++ Compatibility

    extern "C" {

#endif
// DOM-IGNORE-END

// *****************************************************************************
// *****************************************************************************
// Section: Constants & Data Types
// *****************************************************************************
// *****************************************************************************

//*****************************************************************************
/* RMII Speed Selection

  Summary:
    Lists the possible speed selection for the Reduced Media Independent 
    Interface (RMII).

  Description:
    This enumeration lists the possible speed selection for RMII.
    The body contains only two states: RMII_10Mbps or RMII_100Mbps.

  Remarks:
    This enumeration is processor specific and is defined in the processor-
    specific header files (see processor.h).
*/
typedef enum {

    ETH_RMII_10Mbps  /*DOM-IGNORE-BEGIN*/ = 0x00 /*DOM-IGNORE-END*/,
    ETH_RMII_100Mps  /*DOM-IGNORE-BEGIN*/ = 0x01 /*DOM-IGNORE-END*/

} ETH_RMII_SPEED;


//*****************************************************************************
/* MII Clock Selection

  Summary:
    Lists the possible speed selection for the Reduced Media Independent 
    Interface (RMII).

  Description:
    This enumeration lists the possible speed selection for RMII.
    The body contains only two states: RMII_10Mbps or RMII_100Mbps.

  Remarks:
    This enumeration is processor specific and is defined in the processor-
    specific header files (see processor.h).
*/
typedef enum {

    ETH_MIIM_SYSCLK_DIV_BY_4   /*DOM-IGNORE-BEGIN*/ = 0x00 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_RSVD   /*DOM-IGNORE-BEGIN*/ = 0x01 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_6   /*DOM-IGNORE-BEGIN*/ = 0x02 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_8   /*DOM-IGNORE-BEGIN*/ = 0x03 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_10  /*DOM-IGNORE-BEGIN*/ = 0x04 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_14  /*DOM-IGNORE-BEGIN*/ = 0x05 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_20  /*DOM-IGNORE-BEGIN*/ = 0x06 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_28  /*DOM-IGNORE-BEGIN*/ = 0x07 /*DOM-IGNORE-END*/ ,
    ETH_MIIM_SYSCLK_DIV_BY_40  /*DOM-IGNORE-BEGIN*/ = 0x08 /*DOM-IGNORE-END*/

} ETH_MIIM_CLK;


//*****************************************************************************
/* Pattern Match Modes

  Summary:
    Lists the possible pattern match values.

  Description:
    This enumeration lists the pattern match mode values.

  Remarks:
    In all pattern match enabled cases, it is the pattern match inversion XOR 
    pattern match checksum AND <enum option>.

    Some states were omitted from the enumeration since they were duplicates.

    This enumeration is processor specific and is defined in the processor-
    specific header files (see processor.h).
*/

typedef enum _ETH_PATTERN_MATCH_MODE_
{

    ETH_PATTERN_MATCH_DISABLED            /*DOM-IGNORE-BEGIN*/=0x00/*DOM-IGNORE-END*/,//Pattern Match is disabled; pattern match is always unsuccessful
    ETH_PATTERN_MATCH_MODE_CHECKSUM_MATCH /*DOM-IGNORE-BEGIN*/=0x01/*DOM-IGNORE-END*/,//Pattern match if (NOTPM = 1 XOR Pattern Match Checksum matches)
    ETH_PATTERN_MATCH_MODE_STATION_ADDR   /*DOM-IGNORE-BEGIN*/=0x02/*DOM-IGNORE-END*/,//Pattern match if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Station Address)
    ETH_PATTERN_MATCH_MODE_UNICAST_ADDR   /*DOM-IGNORE-BEGIN*/=0x04/*DOM-IGNORE-END*/,//Pattern match if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Unicast Address)
    ETH_PATTERN_MATCH_MODE_BROADCAST_ADDR /*DOM-IGNORE-BEGIN*/=0x06/*DOM-IGNORE-END*/,//Pattern match if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Destination Address = Broadcast Address)
    ETH_PATTERN_MATCH_MODE_HASH_MATCH     /*DOM-IGNORE-BEGIN*/=0x08/*DOM-IGNORE-END*/,//Pattern match if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Hash Table Filter match)
    ETH_PATTERN_MATCH_MODE_MAGIC_PACKET   /*DOM-IGNORE-BEGIN*/=0x09/*DOM-IGNORE-END*/ //Pattern match if (NOTPM = 1 XOR Pattern Match Checksum matches) AND (Packet = Magic Packet)

} ETH_PATTERN_MATCH_MODE;


//*****************************************************************************
/* ETH Module Receive Filter Mask

  Summary:
    Lists the possible values of the receive filter.

  Description:
    This enumeration lists the possible values of the receive filter.

