renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the 
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PauseTimerSet(ETH_MODULE_ID index, uint16_t PauseTimerValue);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_PauseTimerGet(ETH_MODULE_ID index)

  Summary:
    Gets the Pause Timer value used for flow control.

  Description:
    This function gets the Pause Timer value used for flow control.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - PauseTimerValue - Pause Timer Value

  Example:
    <code>
    PauseTimerValue = PLIB_ETH_PauseTimerGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_PauseTimerGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_Enable(ETH_MODULE_ID index)

  Summary:
    Enables the Ethernet module.

  Description:
    This function enables the Ethernet module.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_Enable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_Enable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_Disable(ETH_MODULE_ID index)

  Summary:
    Disables the Ethernet module.

  Description:
    This function disables the Ethernet module.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_Disable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_Disable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_IsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module enable status.

  Description:
    This function returns the Ethernet module enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module is enabled
    - false - Ethernet module is disabled

  Example:
    <code>
    stat = PLIB_ETH_IsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_IsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_StopInIdleEnable(ETH_MODULE_ID index)

  Summary:
    Ethernet module operation will stop when the device enters Idle mode.

  Description:
    This function directs the Ethernet module to stop operation when the device 
    enters Idle mode.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_StopInIdleEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_StopInIdleEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_StopInIdleDisable(ETH_MODULE_ID index)

  Summary:
    Ethernet module operation will continue when the device enters Idle mode.

  Description:
    This function directs the Ethernet module to continue operation when the
    device enters Idle mode.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_StopInIdleDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_StopInIdleDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_StopInIdleIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module Stop in Idle mode enable status.

  Description:
    This function returns the Ethernet module Stop in Idle mode enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module transfers stop during Idle mode
    - false - Ethernet module transfers continue to run during Idle mode

  Example:
    <code>
    stat = PLIB_ETH_StopInIdleIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_StopInIdleIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxRTSEnable(ETH_MODULE_ID index)

  Summary:
    Enables the Ethernet transmit request to send.

  Description:
    This function enables the Ethernet request to send. Transmit logic is activated
    and any packets defined in the Ethernet descriptor table are transmitted.

  Precondition:
    The TX descriptor list and TX DMA must be initialized using 
    PLIB_ETH_TransmitPacketDescStartAddrSet.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxRTSEnable(MY_ETH_INSTANCE);
    </code>

