renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_AutoFlowControlDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_AutoFlowControlIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module Automatic Flow Control status.

  Description:
    This function gets the Ethernet Automatic Flow Control enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module Automatic Flow Control is enabled
    - false - Ethernet module Automatic Flow Control is disabled

  Example:
    <code>
    stat = PLIB_ETH_AutoFlowControlIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_AutoFlowControlIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ManualFlowControlEnable(ETH_MODULE_ID index)

  Summary:
    Enables the Ethernet Manual Flow Control logic.

  Description:
    This function enables the Ethernet Manual Flow Control logic. Enabling Manual 
    Flow Control will send a Pause frame using the Pause Timer value. While enabled, 
    a Pause frame is repeated every 128 x (Pause timer value)/2 transmit clock cycles.

    Affects both transmit and receive operations.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ManualFlowControlEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ManualFlowControlEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ManualFlowControlDisable(ETH_MODULE_ID index)

  Summary:
    Disable Ethernet module Manual Flow Control logic.

  Description:
    This function disables the Ethernet Manual Flow Control logic and automatically 
    sends a Pause frame with a 0x0000 Pause Timer value. This function affects
    both transmit and receive operations.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ManualFlowControlDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Disabling Manual Flow Control will automatically send a Pause frame with
    a 0x0000 Pause Timer value to disable flow control.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ManualFlowControlDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_ManualFlowControlIsEnabled(ETH_MODULE_ID index)

 Summary:
    Gets the Ethernet module Manual Flow Control enable status.

  Description:
    This function returns the Ethernet module Manual Flow Control enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module Manual Flow Control is enabled
    - false - Ethernet module Manual Flow Control is disabled

  Example:
    <code>
    stat = PLIB_ETH_ManualFlowControlIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ManualFlowControlIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxBufferCountDecrement(ETH_MODULE_ID index)

  Summary:
    Causes the Receive Descriptor Buffer Counter to decrement by 1.

  Description:
    This function causes the Receive Descriptor Buffer Counter to decrement by 1.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxBufferCountDecrement(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Hardware increments the receive buffer counter and software decrements it.
    If the receive buffer counter is incremented by the receive logic
    at the same time, the receive buffer counter will appear unchanged.

    Always reads as '0', so there is no get value routine.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxBufferCountDecrement(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ReceiveBufferSizeSet(ETH_MODULE_ID index, uint8_t ReceiveBufferSize)

  Summary:
    Sets the Ethernet module receive buffer size.

  Description:
    This function sets the Ethernet receive buffer size. The buffer size
    is set from 16 bytes up to 2032 bytes in increments of 16 bytes each.

  Precondition:
    None.

  Parameters:
    index             - Identifier for the device instance
    ReceiveBufferSize - In units of 16 bytes, must be a value of 0x01 to 0x7F, 
                        0x00 is invalid
  
  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveBufferSizeSet(MY_ETH_INSTANCE, ReceiveBufferSize/16 );
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

