renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
void PLIB_ETH_ReceiveBufferSizeSet(ETH_MODULE_ID index, uint8_t ReceiveBufferSize);

//******************************************************************************
/* Function:
    int PLIB_ETH_RxSetBufferSize(ETH_MODULE_ID index, int rxBuffSize)

  Summary:
    Sets the Ethernet module receive buffer size.

  Description:
   This function sets the required buffer size for the receive operation.
    In this implementation, all receive descriptors use the same buffer 
	size (unlike the transmission flow where each descriptor can have 
	a different buffer size)

  Precondition:
    0 < rxBuffSize <= 2032

  Parameters:
    index             - Identifier for the device instance
    ReceiveBufferSize - In units of 16 bytes, must be a value of 0x01 to 0x7F, 
                        0x00 is invalid
  
  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveBufferSizeSet(MY_ETH_INSTANCE, ReceiveBufferSize/16 );
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
	This function should be part of the initialization process and should
	NOT be called when the rx process is active! The receive buffer size 
	is always TRUNCATED to a multiple of 16 bytes.
*/
int PLIB_ETH_RxSetBufferSize(ETH_MODULE_ID index,int rxBuffSize);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_ReceiveBufferSizeGet(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module receive buffer size.

  Description:
    This function gets the Ethernet receive buffer size. The buffer size
    is set from 16 bytes up to 2032 bytes in increments of 16 bytes each.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    ReceiveBufferSize - receive buffer size divided by 16

  Example:
    <code>
    size = PLIB_ETH_ReceiveBufferSizeGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_ReceiveBufferSizeGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t *txPacketDescStartAddr)

  Summary:
    Sets the Ethernet module transmit packet descriptor start address.

  Description:
    This function sets the Ethernet transmit packet descriptor start address.

  Precondition:
    No transmit, receive, or DMA operations should be in progress when this
    function is called. Call this function before enabling transmit and
    receive.

  Parameters:
    index                 - Identifier for the device instance
    txPacketDescStartAddr - This address must be 4-byte aligned. (The least 
                            significant 2 bits must be '00'.)

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxPacketDescAddrSet(MY_ETH_INSTANCE, txPacketDescStartAddr)
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t *txPacketDescStartAddr);


//******************************************************************************
/* Function:
    uint8_t *PLIB_ETH_TxPacketDescAddrGet(ETH_MODULE_ID index)

  Summary:
    Gets the address of the next descriptor to be transmitted.

  Description:
    This function gets the address of the next transmit descriptor.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    Transmit Packet Descriptor Start Address.

  Example:
    <code>
    txPacketDescAddr = PLIB_ETH_TxPacketDescAddrGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t *PLIB_ETH_TxPacketDescAddrGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t *rxPacketDescStartAddr)

   Summary:
    Sets the Ethernet module receive packet descriptor start address.

  Description:
    This function sets the Ethernet receive packet descriptor start address.

  Precondition:
    No transmit, receive, or DMA operations should be in progress when this
    function is called. Call this function before enabling transmit and
    receive.

  Parameters:
    index                 - Identifier for the device instance
    rxPacketDescStartAddr - This address must be 4-byte aligned. (The least 
                            significant 2 bits must be '00'.)

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxPacketDescAddrSet(MY_ETH_INSTANCE, rxPacketDescStartAddr)
    </code>

  Remarks:
   This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t *rxPacketDescStartAddr);



//******************************************************************************
/* Function:
    uint8_t *PLIB_ETH_RxPacketDescAddrGet(ETH_MODULE_ID index)

  Summary:
    Gets the address of the next receive descriptor.

  Description:
    This function gets the address of the next receive descriptor to be used.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - ReceivePacketDescriptorAddress - receive packet descriptor address

  Example:
    <code>
    RxPacketDescAddr = PLIB_ETH_RxPacketDescAddrGet(MY_ETH_INSTANCE);
    </code>

