renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t * PLIB_ETH_RxPacketDescAddrGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_HashTableSet(ETH_MODULE_ID index, uint64_t hashTableValue)

  Summary:
    Sets the Ethernet module Hash table with the new value.

  Description:
    This function sets the Hash table with the new value.

  Precondition:
    Call PLIB_ETH_HashTableFilterDisable to disable the Hash table filter
    before changing the hash table, or set the Hash Table prior to calling 
    PLIB_ETH_ReceiveEnable.

  Parameters:
    index - Identifier for the device instance
    hashTableValue - hash table value (64-bits)

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_HashTableSet(MY_ETH_INSTANCE, hashTableValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_HashTableSet(ETH_MODULE_ID index, uint64_t hashTableValue);



//******************************************************************************
/* Function:
    void  PLIB_ETH_RxFiltersHTSet ( ETH_MODULE_ID index, uint64_t htable )

  Summary:
    Sets the hash table for the hash table RX filter.

  Description:
     This function sets the hash table for the hash table RX filter.

  Precondition:
    This function should not be called when Ethernet RX operation is enabled and the
    hash filter is active.

  Parameters:
    index       - Identifier for the device instance.
    htable      - The hash table itself

  Returns:
    None.

  Example:
     <code>
    </code>

  Remarks:
    Properly set the hash table with this function before enabling the Hash
    Table filter.
*/
void  PLIB_ETH_RxFiltersHTSet ( ETH_MODULE_ID index, uint64_t htable );

//******************************************************************************
/* Function:
    uint64_t PLIB_ETH_HashTableGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the Hash table.

  Description:
    This function gets the value of the Hash table.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - hashTable - Hash table value (64-bits)

  Example:
    <code>
    value = PLIB_ETH_HashTableGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint32_t PLIB_ETH_HashTableGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PatternMatchSet(ETH_MODULE_ID index, uint64_t patternMatchMaskValue)

  Summary:
    Sets the Ethernet module pattern match mask register with the new value.

  Description:
    This function sets the pattern match mask register with the new value.

  Precondition:
    Call PLIB_ETH_PatternMatchModeSet(index,ETH_PATTERN_MATCH_DISABLED) to
    disable PatternMatch before changing the pattern match mask,
    or set the value before calling PLIB_ETH_ReceiveEnable.

  Parameters:
    index - Identifier for the device instance
    patternMatchMaskValue - Pattern Match Mask Values (64-bits)

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PatternMatchSet(MY_ETH_INSTANCE, patternMatchMaskValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PatternMatchSet(ETH_MODULE_ID index, uint64_t patternMatchMaskValue);


//******************************************************************************
/* Function:
    uint64_t PLIB_ETH_PatternMatchGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the selected pattern match mask register.

  Description:
    This function gets the selected value of the patter match mask register.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - patternMatchMaskValue - Pattern Match Mask Values

  Example:
    <code>
    value = PLIB_ETH_PatternMatchGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint64_t PLIB_ETH_PatternMatchGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PatternMatchChecksumSet(ETH_MODULE_ID index, uint16_t PatternMatchChecksumValue)

  Summary:
    Sets the Ethernet module pattern match checksum register with the new value.

  Description:
    This function sets the pattern match checksum register with the new value.

  Precondition:
    Call PLIB_ETH_PatternMatchModeSet(ETH_PATTERN_MATCH_DISABLED) to
    disable PatternMatch before changing the pattern match mask,
    or set the value before calling PLIB_ETH_ReceiveEnable.

  Parameters:
    index - Identifier for the device instance to be configured
    PatternMatchChecksumValue - Pattern match checksum value

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PatternMatchChecksumSet(MY_ETH_INSTANCE, PatternMatchChecksumValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PatternMatchChecksumSet(ETH_MODULE_ID index, uint16_t PatternMatchChecksumValue);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_PatternMatchChecksumGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the pattern match checksum register.

  Description:
    This function gets the value of the patter match checksum register.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    The pattern match checksum.

  Example:
    <code>
    value = PLIB_ETH_PatternMatchChecksumGet(MY_ETH_INSTANCE);
    </code>

