renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
 */

void PLIB_ETH_RxFiltersPMSet ( ETH_MODULE_ID index,
                              ETH_PMATCH_MODE mode, uint64_t matchMask,
                              uint32_t matchOffs, uint32_t matchChecksum );


//******************************************************************************
/* Function:
    void PLIB_ETH_RxFullWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)

  Summary:
    Sets the Ethernet module to receive a full watermark.

  Description:
    This function sets the Ethernet to receive a full watermark with a new value.

    The software controlled RX Buffer Full Watermark (Wmark) Pointer is compared
    against the receive buffer count to determine the full watermark
    condition for the full watermark interrupt and for enabling flow control
    if Auto Flow Control is enabled.

    The Full Wmark value should always be greater than the Empty Wmark value.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    watermarkValue - Full watermark value

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxFullWmarkSet(MY_ETH_INSTANCE, watermarkValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxFullWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_RxFullWmarkGet(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module to receive a full watermark.

  Description:
    This function gets the Ethernet to receive a full watermark.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - receiveFullWmark - Full watermark value

  Example:
    <code>
    watermarkValue = PLIB_ETH_RxFullWmarkGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_RxFullWmarkGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxEmptyWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)

  Summary:
    Sets the Ethernet module receive empty water mark.

  Description:
    This function sets the Ethernet receive empty water mark with a new value.
    The software controlled Receive Buffer Empty Wmark is compared against
    the receive buffer count to determine the empty watermark condition
    for the empty watermark interrupt and for disabling flow control
    if Auto Flow Control is enabled.

    The Full Wmark value should always be greater than the Empty Wmark value.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    watermarkValue - Empty watermark value

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxEmptyWmarkSet(MY_ETH_INSTANCE, watermarkValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxEmptyWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue);



//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_RxEmptyWmarkGet(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module receive empty watermark.

  Description:
    This function gets the Ethernet receive empty watermark.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - receiveEmptyWmark - Empty watermark value

  Example:
    <code>
    watermarkValue = PLIB_ETH_RxEmptyWmarkGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_RxEmptyWmarkGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_InterruptSourceEnable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)

  Summary:
    Sets the Ethernet module Interrupt Enable register in a group, using a mask.

  Description:
    This function enables the Ethernet module interrupts by using a mask to enable
    one or multiple interrupt enables. Logically 'OR' elements of ETH_INTERRUPT_SOURCES 
    together.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    intmask - Members of ETH_INTERRUPT_SOURCES logically ORed together

  Returns:
    None.

  Example:
    <code>
    // To enable some interrupts with one command, execute the following:
    PLIB_ETH_InterruptSourceEnable(MY_ETH_INSTANCE,
                                        ETH_TRANSMIT_DONE_INTERRUPT                |
                                        ETH_TRANSMIT_ABORT_INTERRUPT               |
                                        ETH_RECEIVE_BUFFER_NOT_AVAILABLE_INTERRUPT |
                                        ETH_RECEIVE_FIFO_OVERFLOW_ERROR_INTERRUPT);

    // Or to enable one interrupt with one command, execute the following:
    PLIB_ETH_InterruptSourceEnable(MY_ETH_INSTANCE, ETH_TRANSMIT_DONE_INTERRUPT);

    // Or to enable all interrupts with one command, execute the following:
    PLIB_ETH_InterruptSourceEnable(MY_ETH_INSTANCE, ETH_ALL_ETH_INTERRUPTS);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_InterruptSourceEnable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);


//******************************************************************************
/* Function:
    void PLIB_ETH_EventsEnableSet ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents )

  Summary:
    Enables the events that will generate interrupts for the Ethernet controller.

  Description:
    The function enables the events that will generate interrupts for the Ethernet
    controller.  Multiple events can be OR-ed together.  Any event that is set
    in the eEvents will be enabled , the other events won't be touched.

  Precondition:
    None.

  Parameters:
    index    - Identifier for the device instance.
    eEvents  - Events with the significance described in the PLIB_ETH_EVENTS definition.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_EventsEnableSet(index,ETH_EV_ALL);
    </code>

