renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
 */

void PLIB_ETH_EventsEnableSet ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents );


//******************************************************************************
/* Function:
    void PLIB_ETH_InterruptSourceDisable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)

  Summary:
    Clears the Ethernet module Interrupt Enable register as a group, using a mask.

  Description:
    This function disables the Ethernet module interrupts by using a mask to select
    one or multiple interrupts to disable. Logically 'OR' elements of 
    ETH_INTERRUPT_SOURCES together.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    intmask - Members of ETH_INTERRUPT_SOURCES logically ORed together

  Returns:
    None.

  Example:
    <code>
    // To disable some interrupts with one command, execute the following:
    PLIB_ETH_InterruptSourceDisble(MY_ETH_INSTANCE,
                                        ETH_TRANSMIT_DONE_INTERRUPT                |
                                        ETH_TRANSMIT_ABORT_INTERRUPT               |
                                        ETH_RECEIVE_BUFFER_NOT_AVAILABLE_INTERRUPT |
                                        ETH_RECEIVE_FIFO_OVERFLOW_ERROR_INTERRUPT );

    // Or to disable one interrupt with one command, execute the following:
    PLIB_ETH_InterruptSourceDisble(MY_ETH_INSTANCE, ETH_TRANSMIT_DONE_INTERRUPT);

    // Or to disable all interrupts with one command, execute the following:
    PLIB_ETH_InterruptSourceDisble(MY_ETH_INSTANCE, ETH_ALL_ETH_INTERRUPTS);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_InterruptSourceDisable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);

//*******************************************************************************
/*  Function:
    void PLIB_ETH_EventsEnableClr ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents )

  Summary:
    Disables the events that will generate interrupts.

  Description:
    The function disables the events that will generate interrupts for the Ethernet
    controller.  Multiple events can be OR-ed together.  Any event that is set
    in the eEvents will be disabled , the other events won't be touched.

  Precondition:
    None.

  Parameters:
    index    - Identifier for the device instance.
    eEvents  - Events with the significance described in the PLIB_ETH_EVENTS definition.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_EventsEnableClr(index,ETH_EV_ALL);
    </code>

  Remarks:
*/

void PLIB_ETH_EventsEnableClr ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents );



//*******************************************************************************
/*  Function:
    void PLIB_ETH_EventsEnableWrite ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents )

  Summary:
    Enables the events that will generate interrupts for the Ethernet controller.

  Description:
    This function enables the events that will generate interrupts for the Ethernet
    controller.  The enabled events are forced to the eEvents value.

  Precondition:
    None.

  Parameters:
    index   - Identifier for the device instance.
    eEvents - Events with the significance described in the PLIB_ETH_EVENTS definition.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_EventsEnableWrite( index,
                          ETH_EV_RXOVFLOW | ETH_EV_RXBUFNA | ETH_EV_TXABORT  |
                          ETH_EV_RXACT    | ETH_EV_PKTPEND | ETH_EV_RXBUSERR |
                          ETH_EV_TXBUSERR );
    </code>

  Remarks:
 */

void PLIB_ETH_EventsEnableWrite ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents );

//******************************************************************************
/* Function:
    bool PLIB_ETH_InterruptSourceIsEnabled(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)

  Summary:
    Gets the Ethernet module Interrupt Enable register singularly or as a group.

  Description:
     This function returns a true if any of the specified interrupt sources are 
     enabled.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    mask  - The interrupt mask(s) to be checked

  Returns:
    - true  - If any of the specified sources are enabled
    - false - If none of the specified sources are enabled

  Example:
    <code>
    if ( PLIB_ETH_InterruptSourceIsEnabled(index, ETH_TRANSMIT_DONE_INTERRUPT))
    {
        //If the interrupt is enabled, disable it...
        PLIB_ETH_InterruptSourceDisable(index, ETH_TRANSMIT_DONE_INTERRUPT);
    }
   </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_InterruptSourceIsEnabled(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);


//******************************************************************************
/* Function:
    ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptSourcesGet(ETH_MODULE_ID index)

  Summary:
    Returns the entire interrupt enable register.

  Description:
    This function returns the entire interrupt enable register.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    Bit map of interrupt sources, all ORed together, as defined by
    ETH_INTERRUPT_SOURCES.

  Example:
    <code>
   </code>

  Remarks:
    None.
*/

ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptSourcesGet(ETH_MODULE_ID index);


//*******************************************************************************
/*  Function:
    PLIB_ETH_EVENTS PLIB_ETH_EventsEnableGet ( ETH_MODULE_ID index )

  Summary:
    Returns the enabled events for the Ethernet controller.

  Description:
    This function returns the enabled events for the Ethernet controller.

  Precondition:
    None.

  Parameters:
    None.

  Returns:
    index   - Identifier for the device instance.
    eEvents - events with the significance described in the PLIB_ETH_EVENTS
    definition.

  Example:
    <code>
    ethEnabledEvents = PLIB_ETH_EventsEnableGet(index);
    </code>

