renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
*/

PLIB_ETH_EVENTS PLIB_ETH_EventsEnableGet ( ETH_MODULE_ID index );

//******************************************************************************
/* Function:
    void PLIB_ETH_InterruptSet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)

  Summary:
    Sets the Ethernet module interrupt source status as a group, using a mask.

  Description:
    This function sets the Ethernet module interrupt source status using a mask.
    Logically 'OR' the masks together. Any masks not OR'd with the others will 
    be disabled.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    intmask - Members of ETH_INTERRUPT_SOURCES logically ORed together

  Returns:
    None.

  Example:
    <code>
    // To set several interrupt flags with one command, execute the following:
    PLIB_ETH_InterruptSet(MY_ETH_INSTANCE,
                                        ETH_EMPTY_WATERMARK_INTERRUPT      |
                                        ETH_FULL_WATERMARK_INTERRUPT       |
                                        ETH_RX_FIFO_OVERFLOW_ERROR_INTERRUPT );
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_InterruptSet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);


//******************************************************************************
/* Function:
    void PLIB_ETH_InterruptClear(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)

  Summary:
    Clears the Ethernet module interrupt source status as a group, using a mask.

  Description:
    This function clears the Ethernet module interrupt source status using a mask.
    Logically 'OR' the masks together. Any masks not ORed with the others will 
    be disabled.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    intmask - Members of ETH_INTERRUPT_SOURCES logically ORed together

  Returns:
    None.

  Example:
    <code>
    // To clear several interrupts with one command, execute the following:
    PLIB_ETH_InterruptClear(MY_ETH_INSTANCE,
                                        ETH_EMPTY_WATERMARK_INTERRUPT      |
                                        ETH_FULL_WATERMARK_INTERRUPT       |
                                        ETH_RX_FIFO_OVERFLOW_ERROR_INTERRUPT );
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_InterruptClear(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);

//*******************************************************************************
/*  Function:
    void PLIB_ETH_EventsClr ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents )

  Summary:
    Clears the selected events for the Ethernet controller.

  Description:
    The function clears the selected events for the Ethernet controller.  Multiple
    events can be OR-ed together. Any event that is set in the eEvents will be
    cleared, the other events won't be touched.

  Precondition:
    None.

  Parameters:
    index    - Identifier for the device instance.
    eEvents  - Events with the significance described in the PLIB_ETH_EVENTS definition.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_EventsClr(index,ETH_EV_TXDONE);
    </code>

  Remarks:
    The ETH_EV_FWMARK cannot be cleared directly. It is cleared indirectly by
    PLIB_ETH_RxAcknowledgePacket/PLIB_ETH_RxAcknowledgeBuffer.

    The ETH_EV_EWMARK cannot be cleared directly. It is cleared by hardware when
    receiving a new packet.

    The ETH_EV_PKTPEND cannot be cleared directly. It is cleared indirectly by
    PLIB_ETH_RxAcknowledgePacket/PLIB_ETH_RxAcknowledgeBuffer.

*/

void PLIB_ETH_EventsClr( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents );


//******************************************************************************
/* Function:
bool PLIB_ETH_InterruptStatusGet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);

  Summary:
    Gets the Ethernet module Interrupt Flag register as a group, using a mask.

  Description:
    This function gets the Ethernet module Interrupt Flag register using a mask.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    intmask - Members of ETH_INTERRUPT_SOURCES logically ORed together

  Returns:
    - true  - If any of the specified source statuses are enabled
    - false - If none of the specified source statuses are enabled

  Example:
    <code>
    if (PLIB_ETH_InterruptStatusGet(index, ETH_TRANSMIT_DONE_INTERRUPT))
    {
        PLIB_ETH_InterruptClear(index, ETH_TRANSMIT_DONE_INTERRUPT);
    }
   </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_InterruptStatusGet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);


//******************************************************************************
/* Function:
    ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptsGet(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module Interrupt Flag register as a group.

  Description:
    Gets the Ethernet module Interrupt Flag register as a group.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    Interrupt bit map, as defined in ETH_INTERRUPT_SOURCES, showing which 
    interrupts have fired.

  Example:
    <code>
   </code>

  Remarks:
    none.
*/

ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptsGet(ETH_MODULE_ID index);


/*******************************************************************************
  Function:
    PLIB_ETH_EVENTS PLIB_ETH_EventsGet ( ETH_MODULE_ID index )

  Summary:
    Returns the active events for the Ethernet controller.

  Description:
    This function returns the active events for the Ethernet controller.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    Events with the significance described in the PLIB_ETH_EVENTS definition.

  Example:
    <code>
    ethEvents = PLIB_ETH_EventsGet(index);
    </code>

