renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
 *****************************************************************************/

PLIB_ETH_EVENTS PLIB_ETH_EventsGet ( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_RxPacketCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the receive packet buffer count.

  Description:
    This function gets the value of the receive packet buffer count.
    When a packet has been successfully received, this value is incremented
    by hardware. Software decrements the counter after a packet has been read.
    Call  PLIB_ETH_ReceiveBufferCountDecrement(ETH_MODULE_ID index) to decrement.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - RxPacketCount - Number of received packets in memory

  Example:
    <code>
    count = PLIB_ETH_RxPacketCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Receive Packet Buffer Counter cannot be decremented below 0x00
    Cleared when the Ethernet module is reset.

    The Receive Packet Buffer Count is not set to '0' when the Ethernet module
    is turned OFF. This allows software to continue to utilize and decrement
    the count.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_RxPacketCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_EthernetIsBusy(ETH_MODULE_ID index)

  Summary:
    Gets the status value of the Ethernet logic busy.

  Description:
    This function sets the value of the Ethernet logic busy. A request indicates 
    that the module has just been turned ON or is completing a transaction after 
    being turned OFF.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet logic has been turned ON or is completing a transaction
    - false - Ethernet logic is idle

  Example:
    <code>
    stat = PLIB_ETH_EthernetIsBusy(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_EthernetIsBusy(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_TransmitIsBusy(ETH_MODULE_ID index)

  Summary:
    Gets the status value of the Ethernet transmit logic busy status

  Description:
    This function gets the value of the Ethernet transmit logic busy status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Transmit logic is sending data
    - false - Transmit logic is idle

  Example:
    <code>
    stat = PLIB_ETH_TransmitIsBusy(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_TransmitIsBusy(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_ReceiveIsBusy(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet receive logic busy status.

  Description:
    This function gets the Ethernet receive logic busy status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Receive logic is receiving data
    - false - Receive logic is idle

  Example:
    <code>
    stat = PLIB_ETH_ReceiveIsBusy(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ReceiveIsBusy(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxOverflowCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the value of the Ethernet receive overflow count to zero.

  Description:
    This function sets the value of the Ethernet receive overflow count to zero.
    Increment counter for frames accepted by the RX filter and subsequently
    dropped due to internal receive error. This event also sets the receive 
    overflow interrupt flag.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxOverflowCountClear(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Setting or clearing any bits in this register
    should be done for debug/test purposes only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxOverflowCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_RxOverflowCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of the dropped Ethernet receive frames.

  Description:
    This function gets the count of the dropped Ethernet receive frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - count - uint16_t receiver overflow counts

  Example:
    <code>
    count = PLIB_ETH_RxOverflowCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_RxOverflowCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FramesTxdOkCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the count of Ethernet Control frames transmitted to zero.

  Description:
    This function sets the count of Ethernet Control frames transmitted to zero.
	This function performs atomic register access. 

	Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    value - Count of control frames transmitted correctly

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FramesTxdOkCountClear(MY_ETH_INSTANCE);
    </code>

