renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    Setting or clearing any bits in this register should be done for 
    debug/test purposes only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FramesTxdOkCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_FramesTxdOkCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of Ethernet Control Frames transmitted successfully.

  Description:
    This function gets the count of Ethernet Control Frames transmitted successfully.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - count - count of control frames transmitted correctly

  Example:
    <code>
    count = PLIB_ETH_FramesTxdOkCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_FramesTxdOkCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_SingleCollisionCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the value of the Ethernet single collision frame count to zero.

  Description:
    This function sets the value of the Ethernet single collision frame count to zero.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    value - Count of single collision frames

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_SingleCollisionCountClear(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_SingleCollisionCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_SingleCollisionCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of the frames transmitted successfully on a second attempt.

  Description:
    This function gets the count of the frames transmitted successfully on
    a second attempt.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - count - Count of frames transmitted successfully on second attempt

  Example:
    <code>
    count = PLIB_ETH_SingleCollisionCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_SingleCollisionCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MultipleCollisionCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the value of the Ethernet multiple collision frame count to zero.
	
  Description:
    This function sets the value of the Ethernet multiple collision frame count to zero.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    value - Count of multiple collision frames

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MultipleCollisionCountClear(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Setting or clearing any bits in this register should be done for 
    debug/test purposes only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MultipleCollisionCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_MultipleCollisionCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of the frames transmitted successfully after there was more 
    than one collision.

  Description:
    This function gets the count of the frames transmitted successfully after 
    there was more than one collision.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - count - Count of multiple collision frames

  Example:
    <code>
    count = PLIB_ETH_MultipleCollisionCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_MultipleCollisionCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FramesRxdOkCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the value of the Ethernet received frames 'OK' count to zero.

  Description:
    This function sets the value of the Ethernet frames 'OK' count to zero.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    value - Count of frames received correctly

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FramesRxdOkCountClear(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Changing the value of this register should be done for debug/test 
    purposes only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FramesRxdOkCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_FramesRxdOkCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of the frames frames received successfully.

  Description:
    This function gets the count of the frames received successfully.
    Increment count for frames received successfully by the RX Filter.
    This count will not be incremented if there is a Frame Check Sequence (FCS)
    or Alignment error.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - value - Count of frames received correctly

  Example:
    <code>
    count = PLIB_ETH_FramesRxdOkCountGet(MY_ETH_INSTANCE);
    </code>

