renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_FramesRxdOkCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FCSErrorCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the value of the Ethernet frame check sequence error to zero.

  Description:
    This function sets the value of the Ethernet frame check sequence error to zero.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    value - Count of FCS Errors

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FCSErrorCountClear(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Setting or clearing any bits in this register should be done for 
    debug/test purposes only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FCSErrorCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_FCSErrorCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of the frame check sequence error.

  Description:
    This function gets the count of the frame check sequence error.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - value - Count of FCS Errors

  Example:
    <code>
    count = PLIB_ETH_FCSErrorCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_FCSErrorCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_AlignErrorCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the count of Ethernet alignment errors to zero.

  Description:
    This function sets the count of Ethernet alignment errors to zero.
	This function performs atomic register access.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    value - count of alignment errors

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_AlignErrorCountClear(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Setting or clearing any bits in this register should be done for 
    debug/test purposes only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_AlignErrorCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_AlignErrorCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of Ethernet alignment errors.

  Description:
    This function gets the count of Ethernet alignment errors.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - value - Count of alignment errors

  Example:
    <code>
    count = PLIB_ETH_AlignErrorCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_AlignErrorCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC MIIM Soft reset.

  Description:
    This function enables the EMAC MIIM soft reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIResetEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIResetEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC Soft reset.

  Description:
    This function disables the EMAC MIIM Soft reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MIIResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets EMAC MIIM Soft Reset enable status.

  Description:
    This function gets EMAC MIIM Soft reset enable status. By default this bit is 
    set to '1'.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true   - MAC MII is in reset
    - false  - MAC MII is not in reset

  Example:
    <code>
    stat = PLIB_ETH_MIIResetIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_MIIResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_SimResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC simulation reset.

  Description:
    This function enables the EMAC simulation reset and resets the random number
    generator within the transmit (TX) function.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_SimResetEnable(MY_ETH_INSTANCE);
    </code>

