renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_RxFuncResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MCSTxResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables the reset of EMAC Control Sub-layer/Transmit domain logic.

  Description:
    This function resets the EMAC Control Sub-layer/Transmit domain logic.
    The MCS/Transmit domain logic is held in reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MCSTxResetEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MCSTxResetEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MCSTxResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables the reset EMAC Control Sub-layer/Transmit domain logic.

  Description:
    This function disables the reset EMAC Control Sub-layer/Transmit domain logic.
    The MCS/Transmit domain logic is released from reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MCSTxResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MCSTxResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MCSTxResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Control Sub-layer/Transmit domain logic reset status.

  Description:
    This function gets the EMAC Control Sub-layer/Transmit domain logic reset status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true   -  EMAC Control Sub-layer/Transmit domain logic is held in reset
    - false  -  EMAC Control Sub-layer/Transmit domain logic is not in reset

  Example:
    <code>
    stat = PLIB_ETH_MCSTxResetIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_MCSTxResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxFuncResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC transmit function reset.

  Description:
    This function enables the EMAC transmit function reset. The transmit function 
    is held in reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxFuncResetEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxFuncResetEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxFuncResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC Transmit function reset.

  Description:
    This function disables the EMAC Transmit function reset. The EMAC transmit 
    function is released from reset for normal operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxFuncResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxFuncResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_TxFuncResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Transmit function reset status.

  Description:
    This function gets the EMAC Transmit function reset status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - EMAC transmit function logic is held in reset
    - false - EMAC transmit function logic is not in reset

  Example:
    <code>
    PLIB_ETH_TxFuncResetIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_TxFuncResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_LoopbackEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC loopback logic.

  Description:
    This function enables the EMAC loopback logic. The EMAC transmit interface is 
    looped back to the EMAC receive interface.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_LoopbackEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_LoopbackEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_LoopbackDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC loopback logic.

  Description:
    This function disables the EMAC loopback. EMAC resumes normal operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_LoopbackDisable(MY_ETH_INSTANCE);
    </code>

