renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_LoopbackDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_LoopbackIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Loopback interface enable status.

  Description:
    This function gets the EMAC Loopback interface enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - EMAC transmit interface is looped back to the EMAC receive interface
    - false - EMAC normal operation

  Example:
    <code>
    stat = PLIB_ETH_LoopbackIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_LoopbackIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxPauseEnable(ETH_MODULE_ID index)

  Summary:
    Enables the transmission Pause frames.

  Description:
    This function enables the transmission Pause frames. The Pause frames are 
    allowed for transmission.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxPauseEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxPauseEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxPauseDisable(ETH_MODULE_ID index)

  Summary:
    Disables the transmission of Pause frames.

  Description:
    This function disables the transmit Pause frames. The Pause frames are blocked 
    from being transmitted.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxPauseDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxPauseDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_TxPauseIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module enable status.

  Description:
    This function gets the Ethernet module enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Pause Flow Control frames are allowed to be transmitted
    - false - Pause Flow Control frames are blocked

  Example:
    <code>
    status = PLIB_ETH_TxPauseIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_TxPauseIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxPauseEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC receive flow control.

  Description:
    This function enables the EMAC receive flow control. The EMAC will act upon 
    the received Pause frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxPauseEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxPauseEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxPauseDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC receive flow control.

  Description:
    This function disables the EMAC receive flow control. The received Pause Flow 
    control frames are ignored.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxPauseDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxPauseDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_RxPauseIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC receive flow pause enable status.

  Description:
    This function gets the EMAC receive flow pause enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC acts upon received Pause Flow Control frames
    - false - Received Pause Flow Control frames are ignored

  Example:
    <code>
    status = PLIB_ETH_RxPauseIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_RxPauseIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PassAllEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC PassAll.

  Description:
    This function enables the EMAC PassAll, which enables both the normal and
    the control frames to be passed.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PassAllEnable(MY_ETH_INSTANCE);
    </code>

