renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PassAllEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PassAllDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC PassAll.

  Description:
    This function disables the EMAC PassAll. Control frames are ignored.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PassAllDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PassAllDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_PassAllIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC PassAll enable status.

  Description:
    This function gets the EMAC PassAll enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC will accept all frames regardless of type
              (normal vs. Control)
    - false - The received Control frames are ignored

  Example:
    <code>
    stat = PLIB_ETH_PassAllIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_PassAllIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ReceiveEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC to receive the frames.

  Description:
    This function enables the EMAC to receive the frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ReceiveEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ReceiveDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC from receiving frames.

  Description:
    This function disables the EMAC from receiving frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ReceiveDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_ReceiveIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet EMAC receive enable status.

  Description:
    This function gets the Ethernet EMAC receive enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Enable the EMAC to receive frames
    - false - Disable the EMAC to receive frames

  Example:
    <code>
    stat = PLIB_ETH_ReceiveIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ReceiveIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ExcessDeferEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC excess defer.

  Description:
    This function enables EMAC excess defer. The EMAC will defer to the carrier 
    indefinitely.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ExcessDeferEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ExcessDeferEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ExcessDeferDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC excess defer.

  Description:
    This function disables EMAC excess defer. The EMAC will abort when the 
    excessive deferral limit is reached.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ExcessDeferDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ExcessDeferDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_ExcessDeferIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC excess defer enable status.

  Description:
    This function gets the EMAC excess defer enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC will defer to carrier indefinitely as per the Standard
    - false - The EMAC will abort when the excessive deferral limit is reached

  Example:
    <code>
    stat = PLIB_ETH_ExcessDeferIsEnabled(MY_ETH_INSTANCE);
    </code>

