renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ExcessDeferIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_BackPresNoBackoffEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC back pressure/no back-off.

  Description:
    This function enables EMAC backpressure/no back-off. The EMAC will not back-off 
    when there is backpressure and collisions occur.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_BackPresNoBackoffEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The EMAC after incidentally causing a collision during backpressure will
    immediately retransmit without back-off reducing the chance of further
    collisions and ensuring transmit packets get sent.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_BackPresNoBackoffEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_BackPresNoBackoffDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC backpressure/no back-off.

  Description:
    This function disables EMAC backpressure/no back-off. The EMAC will back-off 
    when there is backpressure and collisions occur.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_BackPresNoBackoffDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_BackPresNoBackoffDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_BackPresNoBackoffIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC backpressure/no back-off enable status.

  Description:
    This function gets the EMAC backpressure/no back-off enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC after incidentally causing a collision during
              backpressure will immediately retransmit without back-off
              reducing the chance of further collisions and ensuring
              transmit packets get sent
    - false - The EMAC will not remove the back-off

  Example:
    <code>
    stat = PLIB_ETH_BackPresNoBackoffIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_BackPresNoBackoffIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_NoBackoffEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC no back-off.

  Description:
    This function enables EMAC no back-off. The EMAC will not back-off when a 
    collision occurs.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_NoBackoffEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Following a collision, the EMAC will immediately retransmit rather than
    using the Binary Exponential Back-off algorithm as specified in the Standard.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_NoBackoffEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_NoBackoffDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC no back-offs.

  Description:
    This function disables EMAC no back-off. The EMAC will back-off when a 
    collision occurs.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_NoBackoffDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_NoBackoffDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_NoBackoffIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC no back-off enable status.

  Description:
    This function gets the EMAC no back-off enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Following a collision, the EMAC will immediately retransmit
    - false - Following a collision, the EMAC will use the Binary Exponential 
              Back-off algorithm

  Example:
    <code>
    stat = PLIB_ETH_NoBackoffIsEnabled(MY_ETsH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_NoBackoffIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_LongPreambleEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC long preamble enforcement.

  Description:
    This function enables EMAC long preamble enforcement. The EMAC only allows 
    receive packets which contain preamble fields less than 12 bytes in length.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_LongPreambleEnable(MY_ETH_INSTANCE);
    </code>

