renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_LongPreambleEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_LongPreambleDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC long preamble enforcement.

  Description:
    This function disables EMAC long preamble enforcement. The EMAC allows any 
    length preamble.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_LongPreambleDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_LongPreambleDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_LongPreambleIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC long preamble enforcement enable status.

  Description:
    This function gets the EMAC long preamble enforcement enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC only allows receive packets, which contain preamble fields 
              less than 12 bytes in length
    - false - The EMAC allows any length preamble

  Example:
    <code>
    stat = PLIB_ETH_LongPreambleIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_LongPreambleIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PurePreambleEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC pure preamble enforcement.

  Description:
    This function enables EMAC pure preamble enforcement. The EMAC will verify 
    the contents of the preamble and discard packets with errors in the preamble.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PurePreambleEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The EMAC will verify the content of the preamble to ensure it contains 0x55 
    and is error-free. A packet with errors in its preamble is discarded.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PurePreambleEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PurePreambleDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC pure preamble enforcement.

  Description:
    This function disables the EMAC pure preamble enforcement. The EMAC does not 
    perform any preamble checking.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PurePreambleDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PurePreambleDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_PurePreambleIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets EMAC pure preamble enforcement enable status.

  Description:
    This function gets the EMAC pure preamble enforcement enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC will verify the content of the preamble to ensure it
              contains 0x55 and is error-free. A packet with errors in its 
              preamble is discarded.
    - false - The EMAC does not perform any preamble checking

  Example:
    <code>
    stat = PLIB_ETH_PurePreambleIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_PurePreambleIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_AutoDetectPadClear(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option );

  Summary:
    Clears the EMAC Auto-Pad option.

  Description:
    This function sets the EMAC Auto-Pad option. If any auto-pad option other
    than ETH_AUTOPAD_DISABLED_CHECK_CRC is selected, the CRC must be enabled by 
    PLIB_ETH_CRCEnable.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_AutoDetectPadClear(MY_ETH_INSTANCE, PAD_OPTION);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.

*/

void PLIB_ETH_AutoDetectPadClear(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option );


//******************************************************************************
/* Function:
    void PLIB_ETH_AutoDetectPadSet(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option );

  Summary:
    Sets the EMAC Auto-Pad option.

  Description:
    This function sets the EMAC Auto-Pad option. If any auto-pad option other than 
    ETH_AUTOPAD_DISABLED_CHECK_CRC is selected, the CRC must be enabled by 
    PLIB_ETH_CRCEnable.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_AutoDetectPadSet(MY_ETH_INSTANCE, PAD_OPTION);
    </code>

