renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.

*/

void PLIB_ETH_AutoDetectPadSet(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option );

/*DOM-IGNORE-BEGIN*/
//PLIB_ETH_AutoDetectPadSet() will set  bits AUTOPAD, VLANPAD, and PADENABLE.
// Software must also enable CRC.
//  See the FRM PAD Operation Table.
/*DOM-IGNORE-END*/


//******************************************************************************
/* Function:
    ETH_AUTOPAD_OPTION PLIB_ETH_AutoDetectPadGet(ETH_MODULE_ID index);

  Summary:
    Gets the current EMAC Auto-Pad setting.

  Description:
    This function gets the current EMAC Auto-Pad setting.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    ETH_AUTOPAD_OPTION.

  Example:
    <code>
    autoPadOption = PLIB_ETH_AutoDetectPadGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

ETH_AUTOPAD_OPTION PLIB_ETH_AutoDetectPadGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_CRCEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC CRC.

  Description:
    This function enables EMAC CRC. The EMAC will append CRC whether padding is 
    required or not. This must be enabled if auto-padding is enabled.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_CRCEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_CRCEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_CRCDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC CRC.

  Description:
    This function disables EMAC CRC.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_CRCDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The frames presented to the EMAC have a valid CRC

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_CRCDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_CRCIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC CRC enable status.

  Description:
    This function returns the EMAC CRC enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC will append a CRC to every frame whether or not padding
              was required. Must be set if auto-padding is enabled.
    - false - The frames presented to the EMAC have a valid CRC

  Example:
    <code>
    stat = PLIB_ETH_CRCIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_CRCIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_DelayedCRCEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC delayed CRC.

  Description:
    This function enables EMAC delayed CRC. A proprietary packet header exists. Four
    bytes of the packet header are ignored by the CRC function.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_DelayedCRCEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_DelayedCRCEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_DelayedCRCDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC delayed CRC.

  Description:
    This function disables EMAC delayed CRC. No proprietary header exists.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_DelayedCRCDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_DelayedCRCDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_DelayedCRCIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC delayed CRC enable status.

  Description:
    This function returns the EMAC delayed CRC enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - A proprietary header exists. Four bytes of packet header are ignored
              by the CRC function.
    - false - No proprietary header

  Example:
    <code>
    stat = PLIB_ETH_DelayedCRCIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_DelayedCRCIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_HugeFrameEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC to receive huge frames.

  Description:
    This function enables the EMAC receiving the frames of any length.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_HugeFrameEnable(MY_ETH_INSTANCE);
    </code>

