renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_HugeFrameEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_HugeFrameDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC from receiving huge frames.

  Description:
    This function disables the EMAC from receiving huge frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_HugeFrameDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_HugeFrameDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_HugeFrameIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC huge frame enable status.

  Description:
    This function returns the EMAC huge frame enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Frames of any length are transmitted and received
    - false - Huge frames are not allowed for receive or transmit

  Example:
    <code>
    stat = PLIB_ETH_HugeFrameIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_HugeFrameIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FrameLengthCheckEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC frame length check.

  Description:
    This function enables the EMAC frame length check. Both transmit and receive 
    frame lengths are compared to the Length/Type field. If the Length/Type field 
    represents a length, the check is performed. Mismatches are reported on the
    transmit/receive statistics vector.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FrameLengthCheckEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FrameLengthCheckEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FrameLengthCheckDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC frame length check.

  Description:
    This function disables the EMAC frame length check.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FrameLengthCheckDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FrameLengthCheckDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_FrameLengthCheckIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC frame length check status.

  Description:
    This function returns the EMAC frame length check status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Both transmit and receive frame lengths are compared to
              the Length/Type field. If the Length/Type field represents
              a length then the check is performed. Mismatches are reported
              on the transmit/receive statistics vector.
    - false - Length/Type field check is not performed

  Example:
    <code>
    stat = PLIB_ETH_FrameLengthCheckIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_FrameLengthCheckIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FullDuplexEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC full duplex operation.

  Description:
    This function enables the EMAC full duplex operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FullDuplexEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FullDuplexEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FullDuplexDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC full duplex operation.

  Description:
    This function disables the EMAC full-duplex operation, which results in the
    EMAC operating in half-duplex.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FullDuplexDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FullDuplexDisable(ETH_MODULE_ID index);


