renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    bool PLIB_ETH_FullDuplexIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC full duplex enable status.

  Description:
    This function returns the EMAC full duplex enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC operates in Full-Duplex mode
    - false - The EMAC operates in Half-Duplex mode

  Example:
    <code>
    stat = PLIB_ETH_FullDuplexIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_FullDuplexIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_BackToBackIPGSet(ETH_MODULE_ID index, uint8_t backToBackIPGValue)

  Summary:
    Sets the EMAC back-to-back interpacket gap.

  Description:
    This function sets the EMAC back-to-back interpacket gap.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    backToBackIPGValue - Back-to-back interpacket gap

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_BackToBackIPGSet(MY_ETH_INSTANCE, backToBackIPGValue);
    </code>

  Remarks:
    In Full-Duplex mode, the register value should be the desired period
    in nibble times minus 3. In Full-Duplex, the recommended setting is 0x15.

    In Half-Duplex mode, the register value should be the desired period
    in nibble times minus 6. n Half-Duplex, the recommended setting is 0x12.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_BackToBackIPGSet(ETH_MODULE_ID index, uint8_t backToBackIPGValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_BackToBackIPGGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC back-to-back interpacket gap.

  Description:
    This function gets the EMAC back-to-back interpacket gap.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - backToBackIPGValue - Back-to-back interpacket gap (7 bits)

  Example:
    <code>
    value = PLIB_ETH_BackToBackIPGGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_BackToBackIPGGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_NonBackToBackIPG1Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue)

  Summary:
    Sets the EMAC non-back-to-back interpacket gap register 1.

  Description:
    This function sets the EMAC non-back-to-back interpacket gap register 1.
    A value of 0x0C is recommended.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    nonBackToBackIPGValue - Non-back-to-back interpacket gap

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_NonBackToBackIPG1Set(MY_ETH_INSTANCE, nonBackToBackIPGValue);
    </code>

  Remarks:
    This is a programmable field representing the optional carrierSense window
    referenced in the IEEE 802.3 Specification.
    If a carrier is detected during the timing of IPGR1, the MAC defers to the carrier.
    If, however, the carrier comes after IPGR1, the MAC continues timing IPGR2 and
    transmits, knowingly causing a collision, thereby ensuring fair access to the medium.
    Its range of values is 0x0 to IPGR2. Its recommended value is 0xC (12d).

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_NonBackToBackIPG1Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_NonBackToBackIPG1Get(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC non-back-to-back interpacket gap register 1.

  Description:
    This function gets the EMAC non-back-to-back interpacket gap register 1.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - nonBackToBackIPGValue - Non-back-to-back interpacket gap (7 bits)

  Example:
    <code>
    value = PLIB_ETH_NonBackToBackIPG1Get(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_NonBackToBackIPG1Get(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_NonBackToBackIPG2Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue)

  Summary:
    Sets the EMAC non-back-to-back interpacket gap register 2.

  Description:
    This function sets the EMAC non-back-to-back interpacket gap register 2.
    A value of 0x12 is recommended.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    nonBackToBackIPGValue - Non-back-to-back interpacket gap

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_NonBackToBackIPG2Set(MY_ETH_INSTANCE, nonBackToBackIPGValue);
    </code>

  Remarks:
    This is a programmable field representing the non-back-to-back
    Inter-Packet-Gap. Its recommended value is 0x12 (18d), which represents
    the minimum IPG of 0.96 us (in 100 Mbps) or 9.6 us (in 10 Mbps).

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

