renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
void PLIB_ETH_NonBackToBackIPG2Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_NonBackToBackIPG2Get(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC non-back-to-back interpacket gap register 2.

  Description:
    This function gets the EMAC non-back-to-back interpacket gap register 2.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - nonBackToBackIPGValue - Non-back-to-back interpacket gap (7 bits)

  Example:
    <code>
    value = PLIB_ETH_NonBackToBackIPG2Get(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_NonBackToBackIPG2Get(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_CollisionWindowSet(ETH_MODULE_ID index, uint8_t collisionWindowValue)

  Summary:
    Sets the EMAC collision window.

  Description:
    This function sets the EMAC collision window.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    collisionWindowValue - Collision window

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_CollisionWindowSet(MY_ETH_INSTANCE, collisionWindowValue);
    </code>

  Remarks:
    This is a programmable field representing the slot time or collision window
    during which collisions occur in properly configured networks. Since the
    collision window starts at the beginning of transmission, the preamble
    and SFD is included. Its default of 0x37 (55d) corresponds to the count of
    frame bytes at the end of the window.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_CollisionWindowSet(ETH_MODULE_ID index, uint8_t collisionWindowValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_CollisionWindowGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC collision window.

  Description:
    This function gets the EMAC collision window.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - collisionWindowValue - A uint8_t (6-bit) value.

  Example:
    <code>
    value = PLIB_ETH_CollisionWindowGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_CollisionWindowGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ReTxMaxSet(ETH_MODULE_ID index, uint8_t retransmitMax)

  Summary:
    Sets the EMAC maximum retransmissions.

  Description:
    This function sets the EMAC maximum retransmissions.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    retransmitMax - Maximum number of retransmissions

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReTxMaxSet(retransmitMax);
    </code>

  Remarks:
    This is a programmable field specifying the number of retransmission
    attempts following a collision before aborting the packet due to excessive
    collisions. The IEEE 802.3 Specification standard specifies the maximum
    number of attempts (attemptLimit) to be 0xF (15d). Its default is 000.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ReTxMaxSet(ETH_MODULE_ID index, uint16_t retransmitMax);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_ReTxMaxGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC maximum retransmissions.

  Description:
    This function gets the EMAC maximum retransmissions.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - retransmitMax - Maximum number of retransmissions

  Example:
    <code>
    value = PLIB_ETH_ReTxMaxGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The maximum number of attempts is limited to 0x0F.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_ReTxMaxGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MaxFrameLengthSet(ETH_MODULE_ID index, uint16_t MaxFrameLength)

  Summary:
    Sets the EMAC maximum frame length.

  Description:
    This function sets the EMAC maximum frame length.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    MaxFrameLength - Maximum frame length

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MaxFrameLengthSet(MY_ETH_INSTANCE, MaxFrameLength);
    </code>

  Remarks:
    This field resets to 0x05EE, which represents a maximum receive
    frame of 1518 bytes.
    An untagged maximum size Ethernet frame is 1518 bytes.
    A tagged frame adds four octets for a total of 1522 bytes.
    If a shorter/longer maximum length restriction is desired, program
    this 16-bit field.

    If a proprietary header is allowed, this field should be adjusted 
    accordingly. For example, if 4-byte headers are prepended to frames, 
    MACMAXF could be set to 1527 bytes. This would allow the maximum VLAN 
    tagged frame plus the 4-byte header.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MaxFrameLengthSet(ETH_MODULE_ID index, uint16_t MaxFrameLength);

