renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    void PLIB_ETH_MACSetMaxFrame(ETH_MODULE_ID index,uint16_t maxFrmSz)

  Summary:
    Sets the MAC maximum frame size.

  Description:
    This function sets the EMAC maximum frame length.

  Precondition:
    Should be called after PLIB_ETH_Init().

  Parameters:
    index       - Identifier for the device instance.
    maxFrmSz    - Maximum frame for the MAC to transmit or receive.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MACSetMaxFrame(index,0x800);
    </code>

  Remarks:
    The default MAC frame size (0x600) is set by the PLIB_ETH_Init() call.
*/

void PLIB_ETH_MACSetMaxFrame(ETH_MODULE_ID index,uint16_t maxFrmSz);

//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_MaxFrameLengthGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC maximum frame length.

  Description:
    This function gets the EMAC maximum frame length.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - MaxFrameLength - Maximum frame length

  Example:
    <code>
    value = PLIB_ETH_MaxFrameLengthGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_MaxFrameLengthGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RMIIResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC Reset RMII.

  Description:
    This function enables EMAC Reset RMII.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RMIIResetEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RMIIResetEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RMIIResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC Reset RMII.

  Description:
    This function disables EMAC Reset RMII for normal operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RMIIResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RMIIResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_RMIIResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Reset RMII enable status.

  Description:
    This function gets the EMAC Reset RMII enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Reset the EMAC RMII module
    - false - Normal operation

  Example:
    <code>
    stat = PLIB_ETH_RMIIResetIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_RMIIResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RMIISpeedSet(ETH_MODULE_ID index, ETH_RMII_SPEED RMIISpeed)

  Summary:
    Sets EMAC RMII Speed.

  Description:
    This function sets EMAC RMII speed. RMII speed can be either RMII_100Mbps or 
    RMII_10Mbps.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance
    RMIISpeed - RMII_100Mbps or RMII_10Mbps of type ETH_RMII_SPEED

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RMIISpeedSet(MY_ETH_INSTANCE, ETH_RMII_SPEED RMIISpeed);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RMIISpeedSet(ETH_MODULE_ID index, ETH_RMII_SPEED RMIISpeed);


//******************************************************************************
/* Function:
    ETH_RMII_SPEED PLIB_ETH_RMIISpeedGet(ETH_MODULE_ID index)

  Summary:
    Gets the current EMAC RMII speed.

  Description:
    This function gets the current EMAC RMII speed.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - RMII_100Mbps  - RMII running at 100 Mbps
    - RMII_10Mbps   - RMII running at 10 Mbps

  Example:
    <code>
    PLIB_ETH_RMIISpeedGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

ETH_RMII_SPEED PLIB_ETH_RMIISpeedGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TestBackPressEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC Test backpressure.

  Description:
    This function enables EMAC Test backpressure. The EMAC will assert backpressure 
    on the link. Backpressure causes preamble to be transmitted, raising 
    carrier sense. A transmit packet from the system will be sent during backpressure.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TestBackPressEnable(MY_ETH_INSTANCE);
    </code>

