renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is intended for testing only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TestBackPressEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TestBackPressDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC Test backpressure.

  Description:
    This function disables EMAC Test backpressure. The EMAC will resume normal 
    operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TestBackPressDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TestBackPressDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_TestBackPressIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC test backpressure enable status.

  Description:
    This function gets the EMAC test backpressure enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC will assert backpressure on the link. Backpressure causes 
              the preamble to be transmitted, raising the carrier sense. A transmit 
              packet from the system will be sent during backpressure.
    - false - Normal operation

  Example:
    <code>
    PLIB_ETH_TestBackPressIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_TestBackPressIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TestPauseEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC test pause.

  Description:
    This function enables EMAC test pause. The EMAC Control sub-layer will inhibit 
    transmissions, just as if a Pause Receive Control frame with a non-zero pause 
    time parameter was received.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TestPauseEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is intended for testing only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TestPauseEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TestPauseDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC test pause.

  Description:
    This function disables EMAC Test Pause. The EMAC will resume normal operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TestPauseDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is intended for testing only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TestPauseDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_TestPauseIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC test pause enable status.

  Description:
    This function returns the EMAC test pause enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC Control sub-layer will inhibit transmissions, just as if a 
              Pause Receive Control frame with a non-zero pause time parameter was 
              received
    - false - Normal operation

  Example:
    <code>
    stat = PLIB_ETH_TestPauseIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is intended for testing only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_TestPauseIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ShortcutQuantaEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC shortcut pause quanta.

  Description:
    This function enables EMAC shortcut pause quanta. The EMAC reduces the effective 
    pause quanta from 64 byte-times to 1 byte-time.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ShortcutQuantaEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is intended for testing only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ShortcutQuantaEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ShortcutQuantaDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC shortcut pause quanta.

  Description:
    This function disables EMAC shortcut pause quanta. The EMAC will resume normal 
    operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ShortcutQuantaDisable(MY_ETH_INSTANCE);
    </code>

