renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    None.
*/

bool PLIB_ETH_ExistsEnable( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsStopInIdle( ETH_MODULE_ID index )

  Summary:
    Identifies whether the StopInIdle feature exists on the Ethernet module.

  Description:
    This function identifies whether the StopInIdle feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_StopInIdleEnable
    - PLIB_ETH_StopInIdleDisable
    - PLIB_ETH_StopInIdleIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The StopInIdle feature is supported on the device
    - false  - The StopInIdle feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsStopInIdle( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsTransmitRTS( ETH_MODULE_ID index )

  Summary:
    Identifies whether the TransmitRTS feature exists on the Ethernet module.

  Description:
    This function identifies whether the TransmitRTS feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_TxRTSEnable
    - PLIB_ETH_TxRTSDisable
    - PLIB_ETH_TxRTSIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The TransmitRTS feature is supported on the device
    - false  - The TransmitRTS feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsTransmitRTS( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsRxEnable( ETH_MODULE_ID index )

  Summary:
    Identifies whether the ReceiveEnable feature exists on the Ethernet module.

  Description:
    This function identifies whether the ReceiveEnable feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_RxEnable
    - PLIB_ETH_RxDisable
    - PLIB_ETH_RxIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ReceiveEnable feature is supported on the device
    - false  - The ReceiveEnable feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsRxEnable( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsAutoFlowControl( ETH_MODULE_ID index )

  Summary:
    Identifies whether the AutoFlowControl feature exists on the Ethernet module.

  Description:
    This function identifies whether the AutoFlowControl feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_AutoFlowControlEnable
    - PLIB_ETH_AutoFlowControlDisable
    - PLIB_ETH_AutoFlowControlIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The AutoFlowControl feature is supported on the device
    - false  - The AutoFlowControl feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsAutoFlowControl( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsManualFlowControl( ETH_MODULE_ID index )

  Summary:
    Identifies whether the ManualFlowControl feature exists on the Ethernet module.

  Description:
    This function identifies whether the ManualFlowControl feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_ManualFlowControlEnable
    - PLIB_ETH_ManualFlowControlDisable
    - PLIB_ETH_ManualFlowControlIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ManualFlowControl feature is supported on the device
    - false  - The ManualFlowControl feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsManualFlowControl( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsRxBufferCountDecrement( ETH_MODULE_ID index )

  Summary:
    Identifies whether the RxBufferCountDecrement feature exists on the Ethernet module.

  Description:
    This function identifies whether the RxBufferCountDecrement feature is available on
    the Ethernet module. When this function returns true, this function is
    supported on the device:
    - PLIB_ETH_RxBufferCountDecrement

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The RxBufferCountDecrement feature is supported on the device
    - false  - The RxBufferCountDecrement feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsRxBufferCountDecrement( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsReceiveBufferSize( ETH_MODULE_ID index )

  Summary:
    Identifies whether the ReceiveBufferSize feature exists on the Ethernet module.

  Description:
    This function identifies whether the ReceiveBufferSize feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_ReceiveBufferSizeGet
    - PLIB_ETH_ReceiveBufferSizeSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ReceiveBufferSize feature is supported on the device
    - false  - The ReceiveBufferSize feature is not supported on the device

