renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    None.
*/

bool PLIB_ETH_ExistsInterrupt( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsEthernetControllerStatus( ETH_MODULE_ID index )

  Summary:
    Identifies whether the EthernetControllerStatus feature exists on the Ethernet module.

  Description:
    This function identifies whether the EthernetControllerStatus feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_RxPacketCountGet
    - PLIB_ETH_EthernetIsBus
    - PLIB_ETH_TransmitIsBusy
    - PLIB_ETH_ReceiveIsBusy

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The EthernetControllerStatus feature is supported on the device
    - false  - The EthernetControllerStatus feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsEthernetControllerStatus( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsReceiveOverflowCount( ETH_MODULE_ID index )

  Summary:
    Identifies whether the ReceiveOverflowCount feature exists on the Ethernet module.

  Description:
    This function identifies whether the ReceiveOverflowCount feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_RxOverflowCountClear
    - PLIB_ETH_RxOverflowCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ReceiveOverflowCount feature is supported on the device
    - false  - The ReceiveOverflowCount feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsReceiveOverflowCount( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsFramesTransmittedOK( ETH_MODULE_ID index )

  Summary:
    Identifies whether the FramesTransmittedOK feature exists on the Ethernet module.

  Description:
    This function identifies whether the FramesTransmittedOK feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_FramesTxdOkCountClear
    - PLIB_ETH_FramesTxdOkCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The FramesTransmittedOK feature is supported on the device
    - false  - The FramesTransmittedOK feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsFramesTransmittedOK( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsCollisionCounts( ETH_MODULE_ID index )

  Summary:
    Identifies whether the CollisionCounts feature exists on the Ethernet module.

  Description:
    This function identifies whether the CollisionCounts feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_SingleCollisionCountClear
    - PLIB_ETH_SingleCollisionCountGet
    - PLIB_ETH_MultipleCollisionCountClear
    - PLIB_ETH_MultipleCollisionCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The CollisionCounts feature is supported on the device
    - false  - The CollisionCounts feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsCollisionCounts( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsFramexReceivedOK( ETH_MODULE_ID index )

  Summary:
    Identifies whether the FramexReceivedOK feature exists on the Ethernet module.

  Description:
    This function identifies whether the FramexReceivedOK feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_FramesRxdOkCountClear
    - PLIB_ETH_FramesRxdOkCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The FramexReceivedOK feature is supported on the device
    - false  - The FramexReceivedOK feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsFramexReceivedOK( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsFCSErrorCount( ETH_MODULE_ID index )

  Summary:
    Identifies whether the FCSErrorCount feature exists on the Ethernet module.

  Description:
    This function identifies whether the FCSErrorCount feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_FCSErrorCountClear
    - PLIB_ETH_FCSErrorCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The FCSErrorCount feature is supported on the device
    - false  - The FCSErrorCount feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsFCSErrorCount( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsAlignmentErrorCount( ETH_MODULE_ID index )

  Summary:
    Identifies whether the AlignmentErrorCount feature exists on the Ethernet module.

  Description:
    This function identifies whether the AlignmentErrorCount feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_AlignErrorCountClear
    - PLIB_ETH_AlignErrorCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The AlignmentErrorCount feature is supported on the device
    - false  - The AlignmentErrorCount feature is not supported on the device

