renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    None.
*/

bool PLIB_ETH_ExistsAlignmentErrorCount( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMAC_Resets( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MAC_Resets feature exists on the Ethernet module.

  Description:
    This function identifies whether the MAC_Resets feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_MIIResetEnable
    - PLIB_ETH_MIIResetDisable
    - PLIB_ETH_MIIResetIsEnabled
    - PLIB_ETH_SimResetEnable
    - PLIB_ETH_SimResetDisable
    - PLIB_ETH_SimResetIsEnabled
    - PLIB_ETH_MCSRxResetEnable
    - PLIB_ETH_MCSRxResetDisable
    - PLIB_ETH_MCSRxResetIsEnabled
    - PLIB_ETH_RxFuncResetEnable
    - PLIB_ETH_RxFuncResetDisable
    - PLIB_ETH_RxFuncResetIsEnabled
    - PLIB_ETH_MCSTxResetEnable
    - PLIB_ETH_MCSTxResetDisable
    - PLIB_ETH_MCSTxResetIsEnabled
    - PLIB_ETH_TxFuncResetEnable
    - PLIB_ETH_TxFuncResetDisable
    - PLIB_ETH_TxFuncResetIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MAC_Resets feature is supported on the device
    - false  - The MAC_Resets feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMAC_Resets( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMAC_Configuration( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MAC_Configuration feature exists on the Ethernet module.

  Description:
    This function identifies whether the MAC_Configuration feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_LoopbackEnable
    - PLIB_ETH_LoopbackDisable
    - PLIB_ETH_LoopbackIsEnabled
    - PLIB_ETH_TxPauseEnable
    - PLIB_ETH_TxPauseDisable
    - PLIB_ETH_TxPauseIsEnabled
    - PLIB_ETH_RxPauseEnable
    - PLIB_ETH_RxPauseDisable
    - PLIB_ETH_RxPauseIsEnabled
    - PLIB_ETH_PassAllEnable
    - PLIB_ETH_PassAllDisable
    - PLIB_ETH_PassAllIsEnabled
    - PLIB_ETH_ReceiveEnable
    - PLIB_ETH_ReceiveDisable
    - PLIB_ETH_ReceiveIsEnabled
    - PLIB_ETH_ExcessDeferEnable
    - PLIB_ETH_ExcessDeferDisable
    - PLIB_ETH_ExcessDeferIsEnabled
    - PLIB_ETH_BackPresNoBackoffEnable
    - PLIB_ETH_BackPresNoBackoffDisable
    - PLIB_ETH_BackPresNoBackoffIsEnabled
    - PLIB_ETH_NoBackoffEnable
    - PLIB_ETH_NoBackoffDisable
    - PLIB_ETH_NoBackoffIsEnabled
    - PLIB_ETH_LongPreambleEnable
    - PLIB_ETH_LongPreambleDisable
    - PLIB_ETH_LongPreambleIsEnabled
    - PLIB_ETH_PurePreambleEnable
    - PLIB_ETH_PurePreambleDisable
    - PLIB_ETH_PurePreambleIsEnabled
    - PLIB_ETH_AutoDetectPadGet
    - PLIB_ETH_AutoDetectPadSet
    - PLIB_ETH_AutoDetectPadClear
    - PLIB_ETH_CRCEnable
    - PLIB_ETH_CRCDisable
    - PLIB_ETH_CRCIsEnabled
    - PLIB_ETH_DelayedCRCEnable
    - PLIB_ETH_DelayedCRCDisable
    - PLIB_ETH_DelayedCRCIsEnabled
    - PLIB_ETH_HugeFrameEnable
    - PLIB_ETH_HugeFrameDisable
    - PLIB_ETH_HugeFrameIsEnabled
    - PLIB_ETH_FrameLengthCheckEnable
    - PLIB_ETH_FrameLengthCheckDisable
    - PLIB_ETH_FrameLengthCheckIsEnabled
    - PLIB_ETH_FullDuplexEnable
    - PLIB_ETH_FullDuplexDisable
    - PLIB_ETH_FullDuplexIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MAC_Configuration feature is supported on the device
    - false  - The MAC_Configuration feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMAC_Configuration( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsInterPacketGaps( ETH_MODULE_ID index )

  Summary:
    Identifies whether the InterPacketGaps feature exists on the Ethernet module.

  Description:
    This function identifies whether the InterPacketGaps feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_BackToBackIPGGet
    - PLIB_ETH_BackToBackIPGSet
    - PLIB_ETH_NonBackToBackIPG1Get
    - PLIB_ETH_NonBackToBackIPG1Set
    - PLIB_ETH_NonBackToBackIPG2Get
    - PLIB_ETH_NonBackToBackIPG2Set

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The InterPacketGaps feature is supported on the device
    - false  - The InterPacketGaps feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsInterPacketGaps( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsCollisionWindow( ETH_MODULE_ID index )

  Summary:
    Identifies whether the CollisionWindow feature exists on the Ethernet module.

  Description:
    This function identifies whether the CollisionWindow feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_CollisionWindowGet
    - PLIB_ETH_CollisionWindowSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The CollisionWindow feature is supported on the device
    - false  - The CollisionWindow feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsCollisionWindow( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsRetransmissionMaximum( ETH_MODULE_ID index )

  Summary:
    Identifies whether the RetransmissionMaximum feature exists on the Ethernet module.

  Description:
    This function identifies whether the RetransmissionMaximum feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_ReTxMaxGet
    - PLIB_ETH_ReTxMaxSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:

    - true   - The RetransmissionMaximum feature is supported on the device
    - false  - The RetransmissionMaximum feature is not supported on the device

