renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    None.
*/

bool PLIB_ETH_ExistsRetransmissionMaximum( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMaxFrameLength( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MaxFrameLength feature exists on the Ethernet module.

  Description:
    This function identifies whether the MaxFrameLength feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_MaxFrameLengthGet
    - PLIB_ETH_MaxFrameLengthSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MaxFrameLength feature is supported on the device
    - false  - The MaxFrameLength feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMaxFrameLength( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsRMII_Support( ETH_MODULE_ID index )

  Summary:
    Identifies whether the RMII_Support feature exists on the Ethernet module.

  Description:
    This function identifies whether the RMII_Support feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_RMIIResetEnable
    - PLIB_ETH_RMIIResetDisable
    - PLIB_ETH_RMIIResetIsEnabled
    - PLIB_ETH_RMIISpeedGet
    - PLIB_ETH_RMIISpeedSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The RMII_Support feature is supported on the device
    - false  - The RMII_Support feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsRMII_Support( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMAC_Testing( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MAC_Testing feature exists on the Ethernet module.

  Description:
    This function identifies whether the MAC_Testing feature is available on
    the Ethernet module. When this function returns true, these functions are
    supported on the device:
    - PLIB_ETH_TestBackPressEnable
    - PLIB_ETH_TestBackPressDisable
    - PLIB_ETH_TestBackPressIsEnabled
    - PLIB_ETH_TestPauseEnable
    - PLIB_ETH_TestPauseDisable
    - PLIB_ETH_TestPauseIsEnabled
    - PLIB_ETH_ShortcutQuantaEnable
    - PLIB_ETH_ShortcutQuantaDisable
    - PLIB_ETH_ShortcutQuantaIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MAC_Testing feature is supported on the device
    - false  - The MAC_Testing feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMAC_Testing( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMIIM_Config( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MIIM_Config feature exists on the Ethernet module.

  Description:
    This function identifies whether the MIIM_Config feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_MIIMResetEnable
    - PLIB_ETH_MIIMResetDisable
    - PLIB_ETH_MIIMResetIsEnabled
    - PLIB_ETH_MIIMClockGet
    - PLIB_ETH_MIIMClockSet
    - PLIB_ETH_MIIMNoPreEnable
    - PLIB_ETH_MIIMNoPreDisable
    - PLIB_ETH_MIIMNoPreIsEnabled
    - PLIB_ETH_MIIMScanIncrEnable
    - PLIB_ETH_MIIMScanIncrDisable
    - PLIB_ETH_MIIMScanIncrIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MIIM_Config feature is supported on the device
    - false  - The MIIM_Config feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMIIM_Config( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMIIMScanMode( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MIIMScanMode feature exists on the Ethernet module.

  Description:
    This function identifies whether the MIIMScanMode feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_MIIMScanModeEnable
    - PLIB_ETH_MIIMScanModeDisable
    - PLIB_ETH_MIIMScanModeIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MIIMScanMode feature is supported on the device
    - false  - The MIIMScanMode feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMIIMScanMode( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMIIMReadWrite( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MIIMReadWrite feature exists on the Ethernet module.

  Description:
    This function identifies whether the MIIMReadWrite feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_MIIMReadStart
    - PLIB_ETH_MIIMWriteStart

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MIIMReadWrite feature is supported on the device
    - false  - The MIIMReadWrite feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMIIMReadWrite( ETH_MODULE_ID index );


