renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMIIMAddresses( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MIIMAddresses feature exists on the Ethernet module.

  Description:
    This function identifies whether the MIIMAddresses feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_PHYAddressGet
    - PLIB_ETH_PHYAddressSet
    - PLIB_ETH_RegisterAddressGet
    - PLIB_ETH_RegisterAddressSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MIIMAddresses feature is supported on the device
    - false  - The MIIMAddresses feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMIIMAddresses( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMIIWriteReadData( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MIIWriteReadData feature exists on the Ethernet module.

  Description:
    This function identifies whether the MIIWriteReadData feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_MIIMWriteDataSet
    - PLIB_ETH_MIIMReadDataGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MIIWriteReadData feature is supported on the device
    - false  - The MIIWriteReadData feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMIIWriteReadData( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMIIM_Indicators( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MIIM_Indicators feature exists on the Ethernet module.

  Description:
    This function identifies whether the MIIM_Indicators feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_LinkHasFailed
    - PLIB_ETH_DataNotValid
    - PLIB_ETH_MIIMIsScanning
    - PLIB_ETH_MIIMIsBusy

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MIIM_Indicators feature is supported on the device
    - false  - The MIIM_Indicators feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMIIM_Indicators( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsStationAddress( ETH_MODULE_ID index )

  Summary:
    Identifies whether the StationAddress feature exists on the Ethernet module.

  Description:
    This function identifies whether the StationAddress feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_StationAddressGet
    - PLIB_ETH_StationAddressSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The StationAddress feature is supported on the device
    - false  - The StationAddress feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsStationAddress( ETH_MODULE_ID index );

//******************************************************************************
/* Function:
    PLIB_ETH_ExistsRxFiltersPMSet( ETH_MODULE_ID index )

  Summary:
    Identifies whether the Pattern Match Rx Filter feature 
	exists on the Ethernet module.

  Description:
    This function identifies whether the Pattern Match Rx Filter feature is 
	available on the Ethernet module. When this function returns true, 
	these functions are supported on the device:
    -  PLIB_ETH_RxFiltersPMSet

  Preconditions:
    None.

  Parameters:
    index   - Identifier for the device instance

  Returns:
    - true   - The feature is supported on the device
    - false  - The feature is not supported on the device

  Remarks:
    None.
*/
bool PLIB_ETH_ExistsRxFiltersPMSet( ETH_MODULE_ID index );

//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatRxOvflCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of dropped receive frames.

  Description:
    This function returns the current number of dropped receive frames by the
    Ethernet controller.  These are frames accepted by the RX filter but dropped due
    to internal receive error (RX FIFO overrun).

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of dropped receive frames

  Example:
    <code>
    droppedFrames = PLIB_ETH_StatRxOvflCnt(index);
    </code>

  Remarks:
    This statistics register is cleared by the read operation.

    An RX overflow event is signalled by the ETH_EV_RXOVFLOW event (see
    PLIB_ETH_EVENTS definition).
 */

int PLIB_ETH_StatRxOvflCnt ( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
#define PLIB_ETH_StatRxOvflCnt  PLIB_ETH_RxOverflowCountGet
// DOM-IGNORE-END


//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatRxOkCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of successfully received frames.

  Description:
    This function returns the current number of successfully received frames by
    the Ethernet controller.  These are frames accepted by the RX filter (some of
    them may still be dropped because of an RX FIFO overrun).

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of frames received OK

  Example:
    <code>
    numReceived = PLIB_ETH_StatRxOkCnt(index);
    </code>

