renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/microchip/harmony/v2.05/framework/peripheral/eth/plib_eth.h
  Remarks:
    This statistics register is cleared by the read operation.

    Frames with FCS or alignment errors will not increment this count.

 */

int PLIB_ETH_StatRxOkCnt ( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
#define  PLIB_ETH_StatRxOkCnt  PLIB_ETH_FramesRxdOkCountGet
// DOM-IGNORE-END


//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatRxFcsErrCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of frames with FCS received errors.

  Description:
    The function returns the current number of frames with FCS errors received
    by the Ethernet controller.  These are received frames that have an integral
    number of bytes.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of received frames having FCS errors

  Example:
    <code>
    numRxFcsErrors = PLIB_ETH_StatRxFcsErrCnt(index);
    </code>

  Remarks:
    This statistics register is cleared by the read operation.

    Frames with alignment error do not increment this count.

 */

int PLIB_ETH_StatRxFcsErrCnt ( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
  #define  PLIB_ETH_StatRxFcsErrCnt  PLIB_ETH_FCSErrorCountGet
// DOM-IGNORE-END


//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatRxAlgnErrCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of frames with alignment received errors

  Description:
    The function returns the current number of frames with alignment errors
    received by the Ethernet controller.  These are received frames that have FCS
    error and they do not contain an integral number of bytes (aka
    dribble-nibble).

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of received frames having alignment errors

  Example:
    <code>
    numAlignErrors = PLIB_ETH_StatRxAlgnErrCnt(index);
    </code>

  Remarks:
    This statistics register is cleared by the read operation.

 */

int PLIB_ETH_StatRxAlgnErrCnt ( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
#define  PLIB_ETH_StatRxAlgnErrCnt  PLIB_ETH_AlignErrorCountGet
// DOM-IGNORE-END


//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatTxOkCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of frames transmitted successfully

  Description:
    The function returns the current number of frames transmitted successfully by
    the Ethernet controller.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of frames transmitted OK

  Example:
    <code>
    numFramesTx = PLIB_ETH_StatTxOkCnt(index);
    </code>

  Remarks:
    This statistics register is cleared by the read operation.

 */

int PLIB_ETH_StatTxOkCnt ( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
#define  PLIB_ETH_StatTxOkCnt  PLIB_ETH_FramesTxdOkCountGet
// DOM-IGNORE-END


//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatTxSColCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of successfully transmitted frames on the second try

  Description:
    This function returns the current number of transmitted frames that had
    a collision but were successfully transmitted by the Ethernet controller
    on the second try.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of single collision frames

  Example:
    <code>
    numSingleCollisions = PLIB_ETH_StatTxSColCnt(index);
    </code>

  Remarks:
    This statistics register is cleared by the read operation.

 */

int PLIB_ETH_StatTxSColCnt ( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
#define  PLIB_ETH_StatTxSColCnt  PLIB_ETH_SingleCollisionCountGet
// DOM-IGNORE-END


//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatTxMColCnt( ETH_MODULE_ID index )

  Summary:
    Returns the number of current frames transmitted after more than one
    collision occurred.

  Description:
    The function returns the current number of frames successfully transmitted
    by the Ethernet controller after there was more than one collision.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of multiple collision frames

  Example:
    <code>
    numMultiCollisions = PLIB_ETH_StatTxMColCnt(index);
    </code>

  Remarks:
    This statistics register is cleared by the read operation.

 */

int PLIB_ETH_StatTxMColCnt( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
#define  PLIB_ETH_StatTxMColCnt  PLIB_ETH_MultipleCollisionCountClear

// DOM-IGNORE-END

//DOM-IGNORE-BEGIN
#ifdef __cplusplus
}
#endif
//DOM-IGNORE-END

// ****************************************************************************
// ****************************************************************************
// Section: Included Files (continued)
// ****************************************************************************
// ****************************************************************************
/*  The file included below  maps the interface definitions above to appropriate
    implementations defined in the implementation (imp) file(s).
*/
//#include "peripheral/eth/processor/eth_processor.h"

#endif //_PLIB_ETH_H

//******************************************************************************
/* End of File
*/
